{
    "File": [
        "My mum had me at 15 years. No idea who my dad is. I grew up with a single mum who would spend every last dollar on meth or coke. To say we were poor was an understatement. No amount of government assistance can get through to you if your mother is an addict. We moved around a lot, I went to 17 different schools growing up, having no food was a common occurrence. I've been homeless for periods of time as a kid. I've had to wash myself in public restrooms and from time to time I was sent to other 'relatives' to live. I was sexually abused on multiple occasions, and I've kept all of this to myself all these years. When you're a kid it's terrifying to speak out. You already live in a shaky, unstable world so uprooting the last foundation you have, even if it's a drug addled mother is unthinkable. Anyway, fast-forward. I tried really hard in school. I mean really hard. It was the only way I could see myself getting out of the hole I was in. My mum dropped out of school at 14 and all I knew is that I never wanted to end up like her. I got a job the day of my 15th birthday which in my country is the legal age you can start working and to this day, I'm 27 years now, I've not spent a day unemployed. I worked and saved as much as I could and when mum told me she was moving again when I was 16, I said no and moved out on my own. I was tired of starting over. I applied for emancipation and moved into a flat. I've seen her a handful of times since, I'm not even sure where she lives anymore.I went to university, kept up a 4.0 GPA while working near full-time and graduated with first class honors. I don't say this to brag. I sacrificed a lot to pull this off. I trashed my social life, never went on a holiday and ignored parts of my health because I wasn't a prodigy or anything close to it, I just fucking grinded my face off. I got a job in my field, got a post degree qualification, and in the last couple of years I've started clearing $100k+ per year.",
        
        "Used Pell grants and state need grants to cover community college. Then I got a work study job at my community college to build experience and cover remaining tuition expenses. After graduating from community with an associate, I was able to get an entry level IT job. Paid for my bachelor’s tuition in cash from my job, taking night and weekend classes to fit around work. With the bachelors and the experience, I was able to get better and better jobs over time. 17 years from starting and am a manager in the cyber security industry, making over 200k. It’s not that remarkable of a story but I feel pretty good about pulling myself up to a better place than where I started and most of all think it’s worth sharing because anyone could do it too.",
        
        "I am one of seven to a single mom. Besides me, only one of my siblings graduated high school. We both went to college, he dropped out, but I continued on to get my bachelors. I had to save and scrimp every penny to make it work, as there was zero assistance from my mom, understandably. Most of my family has been in jail or are addicted to drugs. I broke the cycle by using their experiences as cautionary example, and always learning and furthering my skill set. I should by all accounts never have the life I have now. Even still, I’m called “The egghead” or “the white sheep” by my family. I was homeless for three years in my early twenties, but still worked and walked everywhere I needed to go.Now I live on a cul de sac with my wife and two children. The kids are in Montessori, I love what I do work wise, and I have no debt outside of a mortgage that is already 60% paid off in the five years we have owned the house. We don’t want for anything at all.I guess the one major thing that surprises me is how close minded and racist my neighbors are. Most of them grew up somewhat privileged and have no idea what life is like for most Americans. I am constantly at odds during conversations trying to keep my rage in check at the ignorance they spew at times. I will call them out but do so in the nicest way possible. It’s a constant balance of knowing my roots and fitting in.I would say I’m lucky, but I worked really hard to get where I am today.",
        
        "My now fiancé and I both grew up with food insecurity and came from abusive households. We got together during my first year of college and he wasn't in school, but we graduated high school the same year.He didn't have a job and I was aimless in school, but I did well. We decided that we wanted to be successful and have fought tooth and nail since. I graduated with two undergrad degrees and got into a very good law school. I always picked up side jobs to make extra money and ended up being a janitor for a long time and took out as much financial aid as I could to ensure a roof over our head. He got a job and kept developing skills and has a great work ethic. He kept applying to better and better jobs and is working a decent job with benefits and a 401k. I'm in my second year of law school and have some jobs lined up and still do some side gigs.We supported and helped each other and did more when the other couldn't. We did it together and I'm not sure we could have otherwise. I'm the first in my family to go to college and graduate and we're both the first in our families to leave the small town we grew up in.",
        
        "I still get surprised that I can buy things for myself. Just outright decide that I want something and the cash for it is actually in my account. I stress out when I purchase non-essential items and experience a weird guilt after the purchase, even though it's fully within my budget.I am solidly upper middle class now and live in a home in an area that would have been inconceivable to me as a child. I have so much food in my house. I even stock extra downstairs. I'll never go hungry again or live on tea and toast for days.As far as how I bridged the gap, I worked my tail end off and tried to make the right decisions in my early 20s. While a lot of my friends were going out, I was working 4 AM to 12:30 shifts at a local hospital so that I could go to class from 1 to 8 during the day. Some nights I'd be getting up for work as my boyfriend at the time was getting home from the bar. It sucked, but I kept my head down and just ground through it.The one regret that I have is that I probably qualified for so much assistance, but because I had no parental or mentor help, I didn't know where to find it. I never applied for any scholarships or anything. Just didn't know how to start or where to ask. This was in the early 90's, so the information isn't as easily accessible as it is now.",
        
        "Thanks to government programs we weren't homeless or starving. Just house insecure and hungry.I got very lucky in attending a small private college. Would have been lost in a big university. Because it was private, they had some money from rich people and could give me some extra money just because. I think I might have been an affirmative action type candidate. I was from the coast and the college was in the Midwest. They also required us to live in dorms and eat their food at the cafeteria, so my housing and food needs were met.I had some difficulty getting started after college. So, the next 4 years were tough. It was the recession of the early 80's, no internet, and I had no job-hunting knowledge. Pre-internet was rough in terms of getting career and job knowledge, especially in rural areas. I did find crappy jobs.Went back to the local community college for accounting courses because at the time all the papers were screaming that we needed eleven billion accountants right now. I figured, okay, I have to be able to succeed. HATED the classes. Accounting is not my thing. However, the classes qualified me to get a job in government, and was able to make my way up and eventually get into IT. More IT classes as well as self-learning and I ended my career in IT.I don't know if it's a big surprise, but I still drag the stink and shame of poverty to this day. Obviously not all the time, but at least a few times a year I'll lose sleep or shed a tear or otherwise have a strong emotion from the privation.Looking back, I wish I'd gotten counseling sooner, more job counseling throughout my career, and maybe taken some bigger risks. More job hopping, leaving one particular crappy job sooner. On the other hand, the thought of being unemployed and starving in the gutter was way too scary. I do take comfort in how far I came, and that I was good at my jobs.",
        
        "My family immigrated to the US in the 90’s. Parents knew no English, worked for minimum wage. We got most of our things from the food bank, WIC, garage sales, and Goodwill. Kmart and Walmart were considered as “expensive” stores. I made it to upper middle class by working hard in school and working hard at work, being a good employee. I received a full ride to college and am currently finishing up my master’s degree.Education and hard work are invaluable. I’m extremely grateful for my teachers who encouraged me and for my employers who saw something special in me. All of them pushed me and helped me get to where I am today.",
        
        "I decided that 'I will have fun when I have money' and went with it, sometimes to the extremes. During middle and high school, I was focusing on school results and math or science inter-school competitions, that yielded some rewards, financial aid and grants in form of books or courses if you've got some results, at one point when I was gifted PC, it was old 486DX in around 2002-2003, so basically recycling trash. I started to learn programming in all the spare time I had. After giving up whatever free time I could have in high school and early college to build some portfolio on my own, I managed to find a job as programmer and move out of family home at that point making more than both parents combined with entry-level pay.Main surprise is that some things I considered normal, like ketchup sandwiches for breakfast, not taking a bath every day because at certain income level soap/shampoo is expensive or living in school and library while only sleeping at home because you have 6 people in two rooms is actually weird and unsettling when you look at it from different perspective. Honestly, until I was working and living on my own for several years, I had no idea how poor we actually were back then.",
        
        "Back in the time I was going to school, I was always among the poorest kids in the class, nearly no one wants to make friends with me cause I didn’t have any money, actually my family didn’t and I didn’t have nice clothes to wear so they would feel embarrassed when hanging out with a friend like me. Even my relatives, they looked my family down and underestimated me and my sister a lot since we were not as wealthy as them. So, I decided to try my best to bring up my family, so my parents could be proud of me and my sister can have someone to follow the footsteps. Then I got good results in college and have quite a good job in a big city, 300km away from my hometown and support my family finance, not much but still good, after that, whenever I come home, my relatives never have the same attitude to me and family as the old time anymore. Growing in a poor family gave me big simulation to try my best. Now my sister can have many good things that I couldn’t have back then, good for her.",
        
        "I'm still new to this upper middle-class thing. I was born to two drug addicts. We lived in a van for a while when I was 4 years old. I was adopted by a couple who were getting ready to retire. They did not originally intend to adopt but my dad was out of the picture and my mom died young. They raised 5 kids on a low-level utility employee's salary. my first year as an Xray tech I made 30% more than my adoptive parents did the last year before retirement. we grew up learning to stretch every dollar. I qualified for every free lunch program and for financial aid grants.The things that helped me bridge the gap were the people who rooted for me. I remember being really young and thinking that I would work construction or be a mechanic, because \"that's what people like me did for a living.\" The biggest barrier between me and success was the low expectations everyone had for me. I was a brown dot in a sea of white. I was that poor adopted kid. I had brothers that were always in trouble, and parents that weren't able to get it together to take care of me.No one ever said anything directly, no one said I couldn't be a doctor, or an engineer, but it was implied. There was also a lot of condescending humor from people when I did have a small success. \"Oh, you did well in the spelling bee, great for you. sometimes you get lucky on the word lineup, maybe someday you'll so something worthwhile.\" It hurt, and they thought that just because I was a kid that I wouldn't understand. Around age 12, shortly after my mom died, I realized that it didn't matter what people thought of me or said about me, I was smart enough and determined enough to do whatever I wanted in life. initially few people saw my potential, those who did, showed genuine interest, gave sound advice, and trusted me to work it all out by myself. Those that doubted always tried to find \"something less challenging\" or almost as good for me. They made planned my life out based on what they thought I was capable of, and it wasn't much.I clawed and scraped my way through college, I worked full time because I missed out on grant money because my university made a mistake on my transcript and refused to correct it. I changed schools 4 times to get all the pre-requisite classes done in 1.5 years instead of 2. I got an angry letter from the dean’s office my last semester because I took 24 credits while working 45 hours/week to finish undergrad. I studied during my breaks at work to get ready for PA school I worked 18 hour shifts to pay for my undergrad. I was relentless, and I couldn't have done it without my people.The ones that saw what I could do, knew that the best thing to do was to take down barriers, and the rest would fall into place. A family friend paid for my CNA certificate. A well-respected doctor took me under his wing and helped me make some of my decisions about work and school. My friends and parents were genuinely happy for me and encouraging with every achievement. My best friend showed up to every award ceremony, and graduation. My adoptive mother allowed me to stay at home for undergrad rent free. My boss made arrangements with my schedule to allow for full time work, and school. Various friends offered couches, meals, and a listening ear for when I had projects due, or workshops to attend. Even my nephews offered time for me to teach them anatomy, physiology, and pathophysiology even though they didn't have any idea what any of it meant.The big difference now, is that I am amazed at the change in value I have at the company I work for. Before graduate school, I was expendable. Now that I am making good money for the company, they give me free meals, clothes, bonuses, and all kinds of perks. It still feels like I'm stealing every time I leave cafeteria without pulling out my wallet. I feel like a celebrity, and I don't like it.",
        
        "My parents could no longer afford to keep me fed with a roof over my head while I attended college, so I've had a job since I was 20. I've had to take a year off just to get enough savings to drop down to part time in order to have time for school. I cannot afford to go to graduate school and get a masters, simply because I don't have the money to pay for it much less the money to live if I were to even attend. I've had to change majors because it would have taken an extra year which I couldn't afford. My mental health has definitely degraded from constant all nights, forcing myself to take large amounts of caffeine to stay awake to take an exam and then go do an eight hour shift, just to do it all again two weeks for the next exam. I did this for 3 years while in school. The type of life is for those with a strong mental and resolve or else you'll just kill yourself.I recently graduated and cooling off before I find employment with my degree.",
        
        "I started my bachelor's degree 10 years ago, as a last resort to keep from being homeless. My mom, a struggling alcoholic, was unable to help me out of high school, and the residence halls at college was the only last-minute option. I didn't want to go to college.My background is important, as it helps explain what my experience at college with Imposter Syndrome was like.I come from a low-income family of substance abusers, high school dropouts, and trauma. My father didn't make it through 8th grade and my mom dropped out in 9th, though eventually getting her GED. This is not to say she was not smart. Intelligence extends far outside of the academic institution. My father inevitably chose drugs and played a part in the dysfunction of my childhood, as I had to move every year, sometimes twice a year. Eventually, my grandmother gained custody of me though she was far from stable, as well. Basically, I left one hell hole for another.Throughout my childhood, my mother preached and pushed education, always pushing me for AP classes, extra curriculars, scholars bowl, band, and a part time job. She always told me that education would be my only way out of the generational trauma and cycle. I do not agree with her, though she tried her best.The Imposter Syndrome peaked it's headed my freshman year of college. Mixed with instability and loneliness, the Imposter Syndrome was able to make me feel like I did not belong in school. I was always feeling a disassociation with the environment there and the monstrosity I come from, as well as the culture and social perspective of all the later generation students. I was working full-time trying to make ends meet. I struggled balancing this with marching band and student government association. My GPA at the time was less than a 2.3. I barely was getting by. I overexerted myself for perfection, and had to \"prove myself\" to others. I felt depressed and lonely.A year before graduating with my bachelor's I ran out of money and had to work for a year and a half to save and finish. I also had to file for dependency override. I went back to school taking 20 hours in one semester, while working full time at a fast-food restaurant. I ended up passing with all A's. I overcome my first battle, but this wasn't enough to warrant me walking across that stage. I still regret not walking.This past year with the pandemic, I, on a whim applied for graduate school. I did not have the minimum GPA, but I wrote a genuine letter and pushed myself to communicate with the purest and rawest form of myself. I was accepted. With the help of my husband, I overcame Imposter Syndrome and am graduating next week with a 4.0 GPA. I wrote about Imposter Syndrome in first-generation students recently and found it therapeutic. I finally acknowledged that I belonged, I am not a fraud, and I did it! You can bet that I will be walking across the stage this time with my head held high, and with my now sober mom in the audience.Anyways, thanks for reading! I hope you push through anything life throws at you and give it to yourself. You deserve it, and you are enough!",
        
        "It's not a syndrome in the traditional medical sense. It's more of a \"feeling out of place\". I grew up relatively poor. There is a certain way that affluent and upper middle class people conduct themselves and raise their ilk up. Those kids entering into college tend to be better prepared, better read, and well ahead of the curve in many cases. Their parents push them towards educational endeavors; talk to them about how the world works and how to work the world in their favor; and encourage them to explore, be curious, lead, and venture out on their own. I was lucky if my parents had the budget for me to play little league baseball.So as the poor kid growing up being surrounded by all these kids at an elite academic institution, you start to feel like you don't belong with these people. They seem, from an outsider, so much smarter, well-rounded, experienced, etc., than you do. Maybe they're not all those things and maybe they have lots of insecurities, but that's how they appear.So, the feelings of ineptitude start creeping into one's psyche. Why am I here? What do I have to offer? Am I dragging the rest of these guys down? I don't know what I'm doing, and I don't know what I don't know. I'm just going to sit here, be quiet, and pretend that I know what I'm doing and hope nobody picks on me until I figure this out.As time goes on and you grow older, you realize most people are bullshitting their ways through life. A lot of people are in the same boat, some just have less awareness of it, Dunning-Kruger effect. The latter group is the most dangerous, because a lot of those types will try to pick apart everybody else's vulnerabilities and sabotage them.",
        
        "I felt this too much definitely. I felt so alone at university, especially since I moved away from home to go to school. in addition, I was the only person who picked a school none of my high school friends ended up going. I was in debt, felt like I couldn't connect to other students etc. The school was predominately affluent, and white students, which I was not. Just the socioeconomic and cultural differences made it hard for me to connect to others and make friends. I had no close support network. The imposter syndrome led me to change my lifestyle for the worse to try to fit in and made me question my identity. For the first two years of uni, I hadn't learned the mental tools to deal with being a social outcast, as I was never one in my hometown. I had depression the whole time and felt like i was in a nightmare. The last two years I wasn't as depressed because I understood better how the \"culture\" at my campus worked.The only thing that kept me positive was the gym, which I can't live without now. The upside of this situation was that I experienced how it sucks to be isolated. I would never wish it upon anybody.",
        
        "Yeah, and it also seems to follow you into your career life. I work in an industry, at the moment, which is a good 'ol boys network. Lots of folks who've been in the biz for generations. And my company does a lot of recruiting out of college, and most of our interns are kids whose parents either work for our company in a senior management/executive capacity, or at another firm. Some of these interns are so much better versed than me, because they've grown up hearing about this industry for the past 20 odd years, while I just broke into it less than four years ago.There is absolutely no doubt in my mind that growing up poor, being a first gen college grad, has offered me significant opportunities I wouldn't have otherwise had, but at great cost to my psychological well-being. I've always felt 10 steps behind everyone else and as if I don't belong doing what I'm doing. But I'm also a very humble, and honest individual, probably comes with the territory of growing up poor, so I also struggle with the idea of \"faking it till you make it\". While I've been relatively good at staying afloat in my career, I've dealt with a lot of anxiety and depression along the way which I think is mostly based in self-doubt.",
        
        "I'm in my junior year, and the pressure is definitely starting to get to me... The statistics published by the university I go to show that over 60% of students have parents with advanced degrees, making in excess of $150k per year, while my mom just has her certification to be a paralegal and my dad has been a mechanic since graduating high school. Neither really have the money to put me through, and my dad's since disowned me, so I rely almost entirely on loans and scholarships, say for money I save through internships.I'm perusing a bachelor's in mechanical engineering, and given how hard the course material has gotten, I worry that I'll crack and it'll all be for nothing. Being LGBTQ+ also doesn't help, since I go to school in the south and have dealt with a lot of crap for being out, mostly from non-students. Beyond discrimination, it's just frustrating because the majority of the other students I interact with never talk about struggling financially, a fact I'd guess comes from their parents having at least their bachelor's degrees and the above financial statistic."
        
    ]
    
}
